{
  "selectedTemplate": 2,
  "headings": {
    "work": "Work Experience",
    "education": "Education",
    "projects": "Technical Articles and Developer Projects",
    "awards": "Certifications",
    "skills": "Skills"
  },
  "basics": {
    "name": "Osinachi Chukwujama",
    "email": "osinachi.chukwujama@gmail.com",
    "phone": "+2348105487627",
    "location": {
      "address": "Lagos, Nigeria"
    },
    "website": "https://www.osinachi.me/"
  },
  "education": [
    {
      "area": "Industrial and Production Engineering",
      "studyType": "Mechanical Engineering",
      "endDate": "August 2023",
      "gpa": "4.52",
      "institution": "Federal University of Technology, Owerri",
      "location": "Owerri",
      "startDate": "Nov 2017"
    }
  ],
  "work": [
    {
      "location": "Lagos, Nigeria",
      "position": "FRONTEND SOFTWARE ENGINEER",
      "website": "",
      "startDate": "July 2021",
      "highlights": [
        "Implemented and optimized the admin dashboard of the crypto payment management system for the Patricia applications using React.js, Next.js, and TailwindCSS, resulting in an 80% improvement in payment management.",
        "Successfully enhanced the frontend resilience of the crypto payment management system by writing component and integration tests using Jest and Playwright, reducing app crashes in production by 90%.",
        "Reduced runtime bugs in the production environment of the payment management system by porting the JavaScript-based React application to TypeScript, ensuring smoother performance, type-safety and efficient debugging.",
        "Increased the security of the payment admin dashboard by 70% by implementing token-based Two-Factor Authentication, ensuring secure access to the payment system.",
        "Refactored the data fetching layer of the application to use React Query, resulting in a reduction of duplicated code and improved performance."
      ],
      "company": "Patricia Technologies",
      "endDate": "Present"
    },
    {
      "highlights": [
        "Produce high-quality, developer-focused blog posts for clients like Jetbrains, Synk, Redpanda, and Containeriq, covering diverse technical topics, programming languages, frameworks, and best practices, thereby increasing developer success.",
        "Create detailed API documentation and integration guides for various clients when working on project-based technical articles to ensure that readers are able to flow seamlessly with the projects on Github.",
        "Develop expertise in specific technologies and platforms such as Azure AD, Hygraph, and Redpanda on behalf of clients, becoming a go-to writer for certain technical subjects within the clients' content offerings, researching and immersing in specific technical domains to provide authoritative content that showcases clients' expertise.",
        "Stay current with industry trends, emerging technologies, and developer communities to ensure the relevance of clients' content, continuously monitoring the ever-evolving technical landscape for relevant topics, and maintaining clients' status as cutting-edge resources for up-to-date technical information."
      ],
      "company": "Draft.dev",
      "position": "Technical Writer (Contract)",
      "location": "Chicago, Illinois (Remote)",
      "startDate": "May 2021",
      "endDate": "Present"
    },
    {
      "highlights": [
        "Worked on making projects usable and understandable by writing technical documentation on how to use them",
        "Revamped the documentation on an AI-Search tool: WikiEducation. Link: https://github.com/sammychinedu2ky/Wiki-Education"
      ],
      "company": "Various Projects",
      "position": "Open-source technical writer",
      "startDate": "July 2019",
      "endDate": "Present"
    }
  ],
  "skills": [
    {
      "level": "",
      "keywords": [
        "JavaScript",
        "Typescript",
        "Python",
        "SQL",
        "PHP",
        "Go"
      ],
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "Git",
        "AWS",
        "Google Cloud Platform",
        "Azure",
        "Docker",
        "Figma",
        "Cypress",
        "Playwright",
        "Postgresql"
      ],
      "name": "Technologies and Tools"
    },
    {
      "keywords": [
        "Next.js",
        "Express.js",
        "Nest.js",
        "Laravel"
      ],
      "name": "Frameworks"
    },
    {
      "keywords": [
        "Communication",
        "Presentation",
        "Critical Analysis",
        "Technical Writing",
        "Attention to detail"
      ],
      "name": "Soft Skills"
    },
    {
      "keywords": [
        "Ahrefs Webmaster Tools",
        "Google Search Console",
        "Google Trends"
      ],
      "name": "Technical Writing Tools:"
    }
  ],
  "projects": [
    {
      "keywords": [
        "Airbyte",
        "Postgresql"
      ],
      "name": "Replicate Data from a PostgreSQL Database to Snowflake",
      "description": "This technical article features a migration process where data is copied from a Postgresql database on a server to a Snowflake datalake. The tool used is Airbyte and the client is also Airbyte.",
      "url": "https://airbyte.io/recipes/postgresql-database-to-snowflake"
    },
    {
      "keywords": [
        null
      ],
      "name": "Microservices Architecture | Ultimate Guide & Tutorial",
      "description": "This is a technical overview of the Microservices architecture. It explains all the bits like why Microservices are used and the ways the architecture could be implemented. The client was Containeriq.",
      "url": "https://www.containiq.com/post/microservices-architecture"
    },
    {
      "keywords": [
        "Java",
        "Apache Kafka",
        "Kafka Streams",
        "Redpanda"
      ],
      "url": "https://redpanda.com/blog/kafka-streams-redpanda/",
      "name": "How to integrate Kafka Streams with Redpanda",
      "description": "This technical article features the use of a Kafka Streams application to perform data aggregation. The client was Redpanda."
    },
    {
      "name": "AnonMsg",
      "description": "AN ANONYMOUS MESSAGING APPLICATION THAT PEOPLE CAN USE TO RECEIVE MESSAGES FROM FRIENDS",
      "url": "https://tbh.ink",
      "keywords": [
        "Next.js",
        "Firebase"
      ]
    },
    {
      "keywords": [
        "Next.js",
        "Adonis.js",
        "Azure"
      ],
      "name": "Mire",
      "description": "A FINTECH APP THAT ALLOWS PEOPLE IN THE DIASPORA TO SEND MONEY TO THEIR LOVED ONES IN NIGERIA",
      "url": "https://mire-five.vercel.app"
    },
    {
      "keywords": [
        "Javascript",
        "Typescript",
        "Python",
        "Tensorflowjs"
      ],
      "name": "Proctify",
      "description": "AN AI REMOTE PROCTORING TOOL THAT USED FOR PROCTORING REMOTE ONLINE EXAMS. ",
      "url": "http://proctify-frontend.vercel.app/"
    }
  ],
  "awards": [
    {
      "date": "Sept 2020",
      "awarder": "Microsoft",
      "summary": "Demonstrated proficiency in cloud computing on Azure and solutions built on the cloud, resulting in achieving the Microsoft AZ-900 certification. ",
      "title": "Azure Fundamentals (AZ-900)"
    },
    {
      "title": "Azure Data Fundamentals (DP-900)",
      "date": "March 2022",
      "awarder": "Microsoft",
      "summary": "Awarded the Microsoft DP-900 certification for demonstrating proficiency in data technologies and tools on Azure."
    },
    {
      "title": "Azure AI Fundamentals (AI-900)",
      "date": "March 2022",
      "awarder": "Microsoft",
      "summary": "Awarded the Microsoft Azure AI-900 certification for demonstrating proficiency in the use of AI services on Azure."
    }
  ],
  "sections": [
    "templates",
    "profile",
    "work",
    "skills",
    "projects",
    "education",
    "awards"
  ]
}